[
  {
    "genre": "iOS App",
    "title": "News",
    "repoLink": "https://github.com/berkeparildar/News",
    "imageUrl": "assets/images/wonders/logo.png",
    "description": "News is an iOS application designed to provide users with access to news articles from multiple categories and sources. The app allows users to customize their news feed by selecting preferred categories, view trending and top articles, and search for specific news stories, all within an intuitive and user-friendly interface.",
    "titleOne": "Features",
    "partOne": "Onboarding and Personalization: Users are greeted with an onboarding page that allows them to select news categories of interest, creating a personalized news feed tailored to their preferences._Personal Feed: The feed page displays the current date, weather information, and a list of articles grouped by the selected categories, offering a customized browsing experience._Trending and Top Articles: The second page of the app showcases trending and top articles from the last day, keeping users updated with the latest important news._Category Navigation: The third page features a horizontally scrollable list of categories and their respective articles. Users can also navigate here by tapping on category titles in their personal feed._Search Functionality: Each page includes a search button in the navigation bar, allowing users to search for articles by keywords and view results in a list format._Seamless Browsing: Implemented paging for smooth and continuous article browsing, enhancing the user experience._Custom Tab Bar: Designed a custom tab bar for easy navigation between different screens within the app._Backend Integration: Utilized the News API to fetch articles and display them in the app, ensuring users have access to up-to-date news content._Technical Stack: Developed using SwiftUI for the user interface, and followed the MVVM (Model-View-ViewModel) architectural pattern to ensure a clean and maintainable codebase.",
    "titleTwo": "How to Use",
    "partTwo": "Onboard and Personalize: Open News, complete the onboarding process by selecting your preferred news categories, and proceed to your personalized feed._Navigate the App: Use the custom tab bar to switch between your personal feed, trending and top articles, and the category page._Browse and Read Articles: Scroll through your personal feed to read articles from your chosen categories, and tap on any article to read it in detail._Search for News: Tap the search button in the navigation bar, enter keywords to find specific articles, and browse the search results._Explore Categories: Navigate to the category page to view articles grouped by category, and tap on any category title in your feed to explore more articles in that category.",
    "videoId": "https://youtu.be/wPzSTrPbEFk",
    "imageOnePath": "assets/images/news/1.png",
    "imageTwoPath": "assets/images/news/2.png",
    "imageThreePath": "assets/images/news/3.png",
    "hasVideo": true,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 3,
    "tags": [
      "Swift",
      "SwiftUI",
      "MVVM"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/news/1.png",
    "thumbnailTwoPath": "assets/images/news/2.png",
    "thumbnailThreePath": "assets/images/news/3.png",
    "thumbnailString": "News is an iOS application designed to provide users with access to news articles from multiple categories and sources."
  },
  {
    "genre": "iOS App",
    "title": "Holler",
    "repoLink": "https://github.com/berkeparildar/Holler",
    "imageUrl": "assets/images/wonders/logo.png",
    "description": "Holler is an iOS social media application inspired by Twitter, where users can share their thoughts, updates, and moments with others. The app provides a platform for users to post text and photos, interact with other users through likes and replies, and follow their favorite people to see their posts in a personalized feed.",
    "titleOne": "Features",
    "partOne": "Tabs and Navigation: The app features three tabs—Search, Feed, and Profile—allowing users to search for other users by username, view posts from followed users, and view or edit personal profile details._Posting and Interaction: Users can create posts with text, photos, or both, and interact with posts by liking or replying._User Profiles: Users can view other users' profiles, follow or unfollow them, and see their posts, profile image, banner image, and follower information._Profile Customization: Users can edit and update their profile images and banner images, with images stored in Firebase Cloud Storage._Backend Integration: The app uses Firebase Firestore for managing user data and posts, Firebase Authentication for account creation and login, and Firebase Cloud Storage for storing images._Technical Stack: Developed using UIKit for the user interface, and following the MVVM (Model-View-ViewModel) architectural pattern to ensure a clean and maintainable codebase.",
    "titleTwo": "How to Use",
    "partTwo": "Sign Up and Log In: Open Holler, sign up with email, password, name, and username, and log in using the registered email and password._Navigate the App: Use the Search Tab to find and follow other users by typing their username, check the Feed Tab to see posts from followed users, and access the Profile Tab to view and edit personal profile information._Create and Interact with Posts: Tap the create post button on the Feed page to add text and/or a photo, tap on a post to view it in detail and see replies, and like or reply to posts to engage with other users._Manage Follows: Search for a user in the Search Tab, tap on their profile, click the follow button to see their posts in your feed, and tap the unfollow button to remove their posts from your feed._Edit Profile: Go to the Profile Tab, tap the edit button, update your profile image or banner image, and save changes to update your profile.",
    "videoId": "https://youtu.be/qzHFDbrYlcA",
    "imageOnePath": "assets/images/holler/1.png",
    "imageTwoPath": "assets/images/holler/2.png",
    "imageThreePath": "assets/images/holler/3.png",
    "hasVideo": true,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 3,
    "tags": [
      "Swift",
      "UIKit",
      "MVVM",
      "Firestore"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/holler/1.png",
    "thumbnailTwoPath": "assets/images/holler/2.png",
    "thumbnailThreePath": "assets/images/holler/3.png",
    "thumbnailString": "Holler is an social media application inspired by Twitter, where users can share their thoughts, updates, and moments with others."
  },
  {
    "genre": "iOS App",
    "title": "Market",
    "repoLink": "https://github.com/berkeparildar/Market",
    "imageUrl": "assets/images/wonders/logo.png",
    "description": "Market is an iOS application designed to transform your phone into a convenient marketplace. The app allows users to browse and purchase products easily through a user-friendly interface featuring categorized product listings, a dynamic cart system, and personalized product suggestions.",
    "titleOne": "Features",
    "partOne": "User Interface: The app opens to a Products Page with a horizontally scrollable category bar at the top and a vertically scrollable product list below, allowing users to easily navigate between different product categories._Adding to Cart: Users can add products to their cart by tapping the '+' button on the product, which then opens a stepper to adjust the quantity. The cart button in the upper right corner shows the total amount in the cart._Detailed Product View: Tapping on a product opens a detailed view where users can add or remove the product from their cart and adjust its quantity._Cart Management: Users can access the cart by tapping the cart button in the navigation bar. The cart page displays all added products with steppers to control their quantity, an empty cart button to clear all items, and a horizontally scrollable list of suggested products based on the categories of items in the cart._Suggested Products: Suggested products appear below the cart items and can be added to the cart by tapping the '+' sign._Order Completion: A button below the suggested products allows users to complete their order. Upon completion, users receive a success notification with the total amount and are automatically navigated back to the Products Page._Data Persistence: Core Data integration ensures that products added to the cart are saved locally, allowing users to retain their cart items even if they quit the app.",
    "titleTwo": "How to Use",
    "partTwo": "Navigate Categories: Open the app to the Products Page and use the horizontally scrollable category bar to browse through different product categories._Add Products to Cart: Tap the '+' button on any product to add it to the cart. Use the stepper to adjust the quantity. The cart button will display the current total amount in the cart._View Product Details: Tap on any product to see more details. From the detailed view, adjust the product quantity or add/remove it from the cart._Manage Cart: Tap the cart button in the navigation bar to view all items in your cart. Adjust quantities using the steppers, or use the empty cart button to remove all items._Add Suggested Products: Scroll through the suggested products list below the cart items and tap the '+' sign to add any suggested item to the cart._Complete Order: Tap the 'Complete Order' button to finalize your purchase. A success notification with the total amount will appear, and you will be navigated back to the Products Page.",
    "videoId": "https://youtu.be/15HQuH9yYJ4",
    "imageOnePath": "assets/images/market/1.png",
    "imageTwoPath": "assets/images/market/2.png",
    "imageThreePath": "assets/images/market/3.png",
    "hasVideo": true,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 3,
    "tags": [
      "Swift",
      "UIKit",
      "VIPER",
      "ASP .NET Core"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/market/1.png",
    "thumbnailTwoPath": "assets/images/market/2.png",
    "thumbnailThreePath": "assets/images/market/3.png",
    "thumbnailString": "Market is an iOS application designed to transform your phone into a convenient marketplace."
  },
  {
    "genre": "iOS App",
    "title": "Weather",
    "repoLink": "https://github.com/berkeparildar/Weather",
    "imageUrl": "assets/images/wonders/logo.png",
    "description": "Weather is an iOS application for instantly checking current weather conditions and forecasts for any location you desire. Weather delivers accurate and up-to-date weather data along with a user-friendly interface.",
    "titleOne": "Features",
    "partOne": "Current Weather and Forecasts: Access real-time weather information including temperature, weather description, local time, and daily/hourly forecasts for any location worldwide._OpenWeatherMap API Integration: Utilizes the OpenWeatherMap API to gather current and forecasted weather data, ensuring reliability and precision._Location Search: Easily find and add locations using the integrated search bar. The app utilizes MKSearch to retrieve location names and coordinates based on user input._Home Screen: Added locations are displayed on the home screen as tiles, each showcasing the current weather temperature, location name, local time, weather description, highest, and lowest temperatures._Detailed Weather Information: Tap on a location tile to delve deeper into its weather forecast. View hourly forecasts, a 5-day outlook with high and low temperatures, and weather descriptions accompanied by weather icons._Dynamic Backgrounds: Each location's tile features a custom image background that dynamically changes based on the local time (day or night) of that location._Persistent Storage with Core Data: The app utilizes Core Data to save added locations. This means that once a location is added, it is stored locally, allowing users to access their preferred locations without the need to add them repeatedly. Users can remove stored locations any time they want from the Home Screen.",
    "titleTwo": "How to Use",
    "partTwo": "Add Locations: Use the search bar in the navigation bar to find and add locations of interest._View Weather Data: Instantly see current weather details on each added location's tile, including temperature, local time, and weather description._Tap on a location tile to access detailed forecasts. View hourly forecasts for the upcoming hours and a 5-day forecast with high and low temperatures.",
    "videoId": "https://youtu.be/gEnF44S22-E",
    "imageOnePath": "assets/images/weather/1.png",
    "imageTwoPath": "assets/images/weather/2.png",
    "imageThreePath": "assets/images/weather/3.png",
    "hasVideo": true,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 3,
    "tags": [
      "Swift",
      "UIKit",
      "MVVM"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/weather/1.png",
    "thumbnailTwoPath": "assets/images/weather/2.png",
    "thumbnailThreePath": "assets/images/weather/3.png",
    "thumbnailString": "Weather is an iOS application for instantly checking current weather conditions and forecasts for any location users desire."
  },
  {
    "genre": "iOS App",
    "title": "Wonders",
    "repoLink": "https://github.com/berkeparildar/Wonders",
    "imageUrl": "assets/images/wonders/logo.png",
    "description": "Wonders is an iOS app developed using SwiftUI, accompanied by a robust backend server developed with ASP.NET Core. The app serves as a comprehensive guide for users to explore tourist attractions and must-visit places in various countries.",
    "titleOne": "Features",
    "partOne": "Country Selection: Users are presented with a grid of country images and names on the home screen. A search bar allows users to quickly locate a specific country of interest._Tourist Attractions: Upon selecting a country, users can explore a list of tourist attractions. Each attraction is accompanied by an image, a name, and a categorization tag (e.g., historic place, museum)._Filter and Sort: Users can refine their search by using the search bar to find a specific attraction. Tags enable users to filter attractions based on categories like historic places, museums, etc. Attractions can be sorted alphabetically for ease of navigation._Attraction Details: Tapping on an attraction provides detailed information. A larger image of the attraction is displayed, along with its current open/closed status. A small map shows the attraction's location using Apple Maps, offering both a standard and a 3D view._Server Interaction: The app fetches data from the ASP.NET Core server via GET requests. The server provides specific JSON data for countries, as well as images for both countries and attractions. Data is decoded into appropriate models for seamless integration into the app.",
    "titleTwo": "How to Use",
    "partTwo": "Use the home screen to visually select a country or employ the search bar for quicker access._Tap on a country to view a list of tourist attractions._Utilize search, tags, and alphabetical sorting to find specific attractions._Tap on an attraction to access detailed information, like its current open/closed status, or the location._Easily go back to select another attraction, explore more destinations, or choose a different country.",
    "videoId": "https://youtu.be/uxPh-ew53DE",
    "imageOnePath": "assets/images/wonders/1.png",
    "imageTwoPath": "assets/images/wonders/2.png",
    "imageThreePath": "assets/images/wonders/3.png",
    "hasVideo": true,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 3,
    "tags": [
      "Swift",
      "SwiftUI",
      "ASP .NET Core"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/wonders/1.png",
    "thumbnailTwoPath": "assets/images/wonders/2.png",
    "thumbnailThreePath": "assets/images/wonders/3.png",
    "thumbnailString": "Wonders is a comprehensive guide for users to explore tourist attractions and must-visit places in various countries."
  },
  {
    "genre": "Arcade Game",
    "title": "Currency Converter",
    "repoLink": "https://github.com/berkeparildar/CurrencyConverter",
    "imageUrl": "assets/images/currencyconverter/logo.png",
    "description": "Currency Converter is an intuitive iOS app developed using SwiftUI, designed to simplify currency conversions effortlessly. As the name suggests, users can utilize this app to convert a specified amount from one currency to another.",
    "titleOne": "Features",
    "partOne": "User-Friendly Interface: Users can easily tap on the currency icons to select their current currency and the target currency for conversion._Wide Currency Support: The app provides access to 16 different currencies, offering a broad range of options for users._Real-time Target Currency Update: The target currency dynamically updates in real-time with each input, allowing users to see instant conversions._Exchange Rates API Integration: Exchange rates for all available currencies are set with the base currency being USD._The entered amount is converted to the target currency by considering the latest exchange rates, ensuring accuracy in calculations.",
    "titleTwo": "How to Use",
    "partTwo": "Launch the App: Open Currency Converter on your iOS device._Currency Selection: Tap the first currency icon to access available currencies. Select your current currency from the list. Use the second currency icon to choose the target currency._Tap the first empty text box to input the amount you wish to convert._The converted amount is displayed in the second text box, providing the equivalent value in the selected target currency.",
    "videoId": "https://youtu.be/OHwwctYCMlY",
    "imageOnePath": "assets/images/currencyconverter/1.png",
    "imageTwoPath": "assets/images/currencyconverter/2.png",
    "imageThreePath": "assets/images/currencyconverter/3.png",
    "hasVideo": true,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 2,
    "tags": [
      "Swift",
      "SwiftUI"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/currencyconverter/1.png",
    "thumbnailTwoPath": "assets/images/currencyconverter/2.png",
    "thumbnailThreePath": "assets/images/currencyconverter/3.png",
    "thumbnailString": "Currency Converter is an iOS app to convert a specified amount of money from one currency to another."
  },
  {
    "genre": "",
    "title": "Decentralized Student Information System",
    "repoLink": "https://github.com/DecentralizedStundetInformationSystem",
    "imageUrl": "assets/images/dsis/dsis.png",
    "description": "The Decentralized Student Information System (DSIS) is a blockchain-based application for student information management. By leveraging the power of decentralized technology, DSIS ensures transparent and secure storage of student data, while providing functionalities such as enrollment, term management, course evaluation, and attendance tracking. DSIS consists of three main components: a server, a desktop application for administrators and staff, and a mobile application for students.",
    "titleOne": "Components",
    "partOne": "Server provides functionalities such as enrollment, term management, course evaluation, and attendance tracking. Built using Node.js, the server component acts as the bridge between the blockchain network and client applications, enabling seamless interactions with the decentralized student information system._The desktop application provides a user-friendly interface for administrators and staff members to efficiently manage student information. Student information that will be written on the blockchain is sent through this application._The mobile application is designed specifically for students, allowing them to access their personal information securely from their mobile devices. It offers features like grades, attendance tracking, and other relevant information.",
    "titleTwo": "Students can: ",
    "partTwo": "Access a list of courses they are enrolled in and view detailed information about each course, including course name, instructor, credits, and evaluation._Check their grades and attendance records for each course, providing them with real-time updates on their academic performance._Log in and register using their email and password through Firebase's email/password authentication. This provides a secure and reliable authentication mechanism for accessing the application.",
    "videoId": "",
    "imageOnePath": "assets/images/dsis/home_screen.png",
    "imageTwoPath": "assets/images/dsis/login_screen.png",
    "imageThreePath": "assets/images/dsis/grades.png",
    "hasVideo": false,
    "hasStore": false,
    "storeUrl": "",
    "tagCount": 4,
    "tags": [
      "Solidity",
      "Flutter",
      "Java",
      "NodeJS"
    ],
    "isPortait": true,
    "thumbnailOnePath": "assets/images/dsis/home_screen.png",
    "thumbnailTwoPath": "assets/images/dsis/login_screen.png",
    "thumbnailThreePath": "assets/images/dsis/grades.png",
    "thumbnailString": "The Decentralized Student Information System (DSIS) is a blockchain-based system for student information management."
  }
]
